//#####################################################################################################################
//#####################################################################################################################
//###############################                    База данных                        ###############################
//#####################################################################################################################
//####    Автор: Кулишов Илья Вячеславович    #########################################################################
//####    Версия: v.0.1.0.0                   #########################################################################
//####    Дата: 09.06.2024                    #########################################################################
//#####################################################################################################################
//#####################################################################################################################
package com.example.pingfly


import androidx.compose.runtime.derivedStateOf
import androidx.compose.runtime.mutableStateOf
import kotlinx.serialization.Serializable

//#####################################################################################
//класс для получения данных сенсора                                       ############
//#####################################################################################
@Serializable
class Sensor(var name:String,var sensorId:Int)
var sensorList = mutableListOf(
    Sensor( "Влажность",0),


)

//#####################################################################################
//класс для получения данных точки                                         ############
//#####################################################################################
class pointReq(var height:Double, var oX:Double, var oY:Double, var pos:Int)


//#####################################################################################
//Выбранные модули                                                         ############
//#####################################################################################
var vyborSensor = mutableListOf<Int>(0,1,2)


//#####################################################################################
//класс для хранения координаты                                            ############
//#####################################################################################
class Coordinate(var x:Double, var y:Double)


//#####################################################################################
//класс для хранения высоты                                                ############
//#####################################################################################
class Up(var up:Double)


//#####################################################################################
//класс для хранения плана полета                                          ############
//#####################################################################################
class Plan(var num:Int, var type:Int,var a:Double,var b:Double)

//#####################################################################################
//текущий полет                                                            ############
//#####################################################################################
var planTek= mutableStateOf( listOf<Plan>() )


//#####################################################################################
//класс для получения показаний с датчиков                                 ############
//#####################################################################################
@Serializable
class sensorDataGet(val UoM:String, val dataId:Int, val dataName:String, val dataType:String,
                      val sensorId:Int, val timestamp:Long, val value:String)

//#####################################################################################
//класс для хранения показаний с датчиков                                  ############
//#####################################################################################
class SensorData(var UoM:String, var dataId:Int, var dataName:String, var dataType:String,
                 var sensorId:Int, var timestamp:Long, var sensorInt:Int, var sensorFloat:Double, var sensorString:String)

var sensorDataList = mutableStateOf(listOf<SensorData>())


//#####################################################################################
//класс для хранения ячеек отображения информации на контроллере           ############
//#####################################################################################
class ViewElements(var id:Int, var status:Boolean, var sensorDataId:Int)

var viewElementsList = mutableStateOf( listOf<ViewElements>(
    ViewElements(0, false, 0),
    ViewElements(1, false, 0),
    ViewElements(2, false, 0),
    ViewElements(3, false, 0),
    ViewElements(4, false, 0),
    ViewElements(5, false, 0),
    ViewElements(6, false, 0),
    ViewElements(7, false, 0),
    ViewElements(8, false, 0),
    ViewElements(9, false, 0),
)
)


//#####################################################################################
//отображение крупных блоков контроллера                                   ############
//#####################################################################################
var viewMediumBlock= ViewElements(0,false, 0)
var viewBigBlock= ViewElements(0,false, 0)


//#####################################################################################
//ссылка на сервер                                                         ############
//#####################################################################################
var adress ="https://95e9-95-174-102-182.ngrok-free.app"