//#####################################################################################################################
//#####################################################################################################################
//###############################                     Навигация                         ###############################
//#####################################################################################################################
//####    Автор: Кулишов Илья Вячеславович    #########################################################################
//####    Версия: v.1.0.0.0                   #########################################################################
//####    Дата: 07.06.2024                    #########################################################################
//#####################################################################################################################
//#####################################################################################################################
package com.example.pingfly

import androidx.compose.material.icons.Icons
import androidx.compose.material.icons.filled.Home
import androidx.compose.material.icons.filled.Person
import androidx.compose.material.icons.filled.Search
import androidx.compose.ui.graphics.vector.ImageVector


//#####################################################################################
//класс для хранения элементов навигации                                   ############
//#####################################################################################
data class BottomNavItem(
    val label: String,
    val icon: Int,
    val route:String,
)

//#####################################################################################
//объекты навигации                                                        ############
//#####################################################################################
object Constants {
    val BottomNavItems = listOf(
        BottomNavItem(
            label = "Drone",
            icon = R.drawable.dronebotom,
            route = "drone"        ),
        BottomNavItem(
            label = "Screen",
            icon = R.drawable.choice,
            route = "view"
        ),
        BottomNavItem(
            label = "Plan",
            icon = R.drawable.mapicon,
            route = "plan"
        ),
        BottomNavItem(
            label = "Lets go",
            icon = R.drawable.propeller,
            route = "flight"
        )
    )
}